{
    "about_intro": "Authors: Julia P. Schessner, Vincent Albrecht, Alexandra K. Davies, Pavel Sinitcyn, Georg H.H. Borner<br><br>The code for this tool is available on [github](https://github.com/valbrecht/SpatialProteomicsQC).<br>If you want to get an overview of the tool please checkout our preprint https://doi.org/10.1101/2021.11.09.467934 or watch the recording of our talk at the [MaxQuant Summer School 2021](https://www.youtube.com/watch?v=dUrOxYHJihc).<br><br>For any immediate questions please contact schessner@biochem.mpg.de.",
    "home_intro": "Welcome to the spatial proteomics quality control tool. Please start by uploading your search enginge output below.<br>Currently accepted input formats are MaxQuant proteinGroups files, Spectronaut long format output files and arbitrary already 0-1 normalized profile data. The webapp only supports upload of files **<80MB**. If you need to upload more please run the app locally from code to load files directly from your filesystem.<br>After specifying your data structure you can then view the results in the 'Analysis' tab. You can also upload multiple files consecutively and compare them under 'Data comparison'.",
    "upload_details": "- MaxQuant proteinGroups: LFQ intensities or SILAC ratios. Experiment names will be used to parse the experimental design\n- Spectronaut output: Long format output (either csv or xls). Required columns are PG.Genes, PG.ProteinGroups, PG.RunEvidenceCount, PG.Quantity and R.Condition. R.Condition will be used to parse the experimental design.\n- Custom upload: In case you already have processed data you can do a custom upload. Under the assumption, that your data is 0-1 normalized. You only need to define which column contains protein ids / gene names and the range of wide format columns that contain the data. Column headers will be used to parse the experimental design.\n- Experimental design: You have to provide a regular expression (several predefined ones are available) containing capture groups for <rep>, <frac> and optionally <cond>. The latter is only used to distinguish same replicate maps of different conditions, but no differential analysis will be done. If you want to compare conditions in terms of quality you should split the file first. Generally the fraction labels are flexible, but if you have an LFQ6 dataset, and want to analyse it as LFQ5 (i.e. omitting the nuclear fraction) it should be labelled '01K'.",
    "coll_status_default": "Datasets available for comparative benchmarking can be added by analysing a new dataset, uploading a stored collection, or loading a stored reference set. The selection made here only affects the alignment of protein groups and the shared PCA space. The overlap used for benchmarking figures can be adjusted after alignment.<br><br>Additional notes:<br><ul><li>When editing experiment names or comments, those will be propagated to the currently aligned benchmark.</li><li>Reannotation of genes, organelle markers and complex members is only necessary if the anntotion sources differ and can only be done prior to alignment.</li><li>Analysis results can be reset to unlock the interface for a new selection of datasets.</li></ul>"

}