{
    "about_intro": "Authors: Julia P. Schessner, Vincent Albrecht, Alexandra K. Davies, Pavel Sinitcyn, Georg H.H. Borner<br><br>The code for this tool is available on [github](https://github.com/JuliaS92/SpatialProteomicsQC).<br>If you want to get an overview of the tool please checkout our preprint https://doi.org/10.1101/2021.11.09.467934 or watch the recording of our talk at the [MaxQuant Summer School 2021](https://www.youtube.com/watch?v=dUrOxYHJihc). Please note that the tool has quite significantly changed since then, so some options might no longer be found in the same place as before.<br><br>For any immediate questions please contact schessner@biochem.mpg.de.",
    "home_intro": "Welcome to DOM-QC - the spatial proteomics quality control tool.<br><br>**Notice**<br>The tool is currently still under review and will expand in the future. Please report any errors on [github](https://github.com/JuliaS92/SpatialProteomicsQC/issues). To get an overview of any recent and upcoming changes check the [changelog](https://github.com/JuliaS92/SpatialProteomicsQC/blob/master/NEWS.md), or the [development branch](https://github.com/JuliaS92/SpatialProteomicsQC/tree/development).<br><br>To format and analyse a single experiment (which can include multiple replicate maps), press on the green button below or go to the 'Analysis' tab.<br>There you can upload your search engine output or preprocessed data.<br><br>**IMPORTANT**<br>The webapp only supports upload of files <80 MB. If your input file is too large, you can either trim unnecessary columns (e.g. fasta headers) or run the app locally from [code](https://github.com/valbrecht/SpatialProteomicsQC) to load files directly from your file system.<br><br>Results from a single experiment can be viewed in the 'Analysis' tab.<br>To benchmark multiple experiments, upload multiple input files consecutively through the 'Analysis' tab. They will then be available for comparison in the 'Benchmark' tab.<br><br>To best compare maps measured in separate experiments, it is recommended to use the same sample naming pattern and fraction names for all files (see 'Analysis' tab).",
	"quick_start_guide": "This guide will allow you to quickly test the DOM-QC tool with data generated in this study.\n\n1. Click on the big green button 'Benchmark multiple experiments'.\n2. From the 'Add reference set' drop-down menu (top right corner), select 'HeLa 1x100min libraryDIA'. Click the 'Load' button.\n3. Repeat Step 2., to load the 'HeLa 1x100min DDA' file. \nYou have now loaded two different sets of maps.\n4. Click the big green button 'Align and analyse selected datasets'. This may take a moment - the program will update on progress and tell you when it's finished (bottom right corner).\n5. Scroll down, and select the 'Overview', 'PCA maps', 'Depth and coverage',... tabs to view the different analyses.<br>To configure your own analysis of profiling data, go to the home page and follow the instructions.",
	"upload_instructions": "1. Configure what kind of data you want to upload by selecting input source, acquisition mode and file orientation. Depending on your selection many parameters regarding column naming will be preset accordingly. If these don't match your file just switch the source to custom.\n2. Enter experiment name.\n3. Choose file for upload.<br>**Note**: Be patient - it can take up to 30 seconds to load, **but** the max file size is 80 MB. If you upload a larger file, the tool will simply do nothing. In case the waittime feels too long, check the file size<br>Tip: You can trim a large files by deleting all unnecessary columns (e.g. fasta headers). After successful upload a file preview and further configuration options will be displayed.\n4. Configure column names. Required columns are containing protein group ids, gene names and quantification values.\n5. Configure fraction naming. Based on a regular expression DOMQC will extract the condition (if present), replicate number and fraction from the column names (in pivot format) or sample column (in long format). Use the fraction card to check correct detection of fractions and to edit them.\n6. Adjust data transformations (log transformation and normalization), usually only necessary in custom mode.\n7. Select Annotations - we currently provide manually curated annotations for human, mouse, yeast and arabidopsis. All annotations can also come from a custom file upload. \n7. Adjust data filtering. The options for complex filters depend on the acquisition mode. If you want to e.g. filter for q-value use the simple column filters.\n8. Download the settings to be able to reproduce the analysis later.\n9. Hit the 'Run processing' button and explore your results.", 
	"upload_details": "- Experimental design: you must provide a name pattern as a regular expression (several predefined patterns are provided), with capture groups for replicate, fraction and, optionally, condition. The latter is only used to distinguish same replicate maps of different conditions, but no differential analysis is performed. To compare quality between conditions, you should first create a separate file for each condition.\n- Adjusting fractions: If you want to omit certain fractions from the analysis, e.g. a full proteome that was analysed in the same run, use the fraction card and empty the coresponding name field.",
	"upload_error_messages": "", 
    "coll_status_default": "1. Add datasets for benchmarking using one of the following methods:\nA. Analyse a dataset in the 'Analysis tab' and it will automatically appear in the 'Benchmark' tab.\nB. Upload a stored collection from a .json file. There is an option to download analysed datasets as collection.\nC. Load our stored reference datasets from the dropdown menu.<br>\n2. Tick to select the datasets that you want to compare.\n3. Press the green button 'Align and analyse selected datasets'.\n4. Explore the data using the tabs below.<br><br>Additional notes:<br><ul><li>The datasets selected here only affect the alignment of protein groups and the shared PCA space. The overlap used for benchmarking figures can be adjusted after alignment.</li><li>Press the red button 'Reset analysis to make new selection' to unlock the interface for a new selection of datasets.</li></ul>",
	"benchmark_error_messages": "", 
    "home_single_shortinstructions": "Upload, filter, normalize and quality control your own datasets here. This is required to then run a benchmark against other datasets.",
    "home_benchmark_shortinstructions": "Compare the performance and quality of different experimental datasets, including published reference datasets."


}
