{
    "about_intro": "Authors: Julia P. Schessner, Vincent Albrecht, Alexandra K. Davies, Pavel Sinitcyn, Georg H.H. Borner<br><br>The code for this tool is available on [github](https://github.com/valbrecht/SpatialProteomicsQC).<br>If you want to get an overview of the tool please checkout our preprint https://doi.org/10.1101/2021.11.09.467934 or watch the recording of our talk at the [MaxQuant Summer School 2021](https://www.youtube.com/watch?v=dUrOxYHJihc).<br><br>For any immediate questions please contact schessner@biochem.mpg.de.",
    "home_intro": "Welcome to DOM-QC - the spatial proteomics quality control tool.<br><br>DISCLAIMER<br>The tool is under development. Please report any errors on [github](https://github.com/valbrecht/SpatialProteomicsQC/issues).<br><br>To format and analyse a single experiment (which can include multiple replicate maps), press on the green button below or go to the 'Analysis' tab.<br>There you can upload your search engine output - currently accepted input formats are MaxQuant proteinGroups files, Spectronaut long format output files and any already 0-1 normalized profile data.<br><br>WARNING!!!<br>The webapp only supports upload of files <80 MB. If your input file is too large, you can either trim unnecessary columns (see 'Analysis' tab) or run the app locally from [code](https://github.com/valbrecht/SpatialProteomicsQC) to load files directly from your file system.<br><br>Results from a single experiment can be viewed in the 'Analysis' tab.<br>To benchmark multiple experiments, upload multiple input files consecutively through the 'Analysis' tab. They will then be available for comparison in the 'Benchmark' tab.<br><br>WARNING<br>To compare maps measured in separate experiments, you must use the same naming pattern for all file names (see 'Analysis' tab).",
	"quick_start_guide": "This guide will allow you to quickly test the DOM-QC tool with data generated in this study.\n\n1. Click on the big green button 'Benchmark multiple experiments'.\n2. From the 'Add reference set' drop-down menu (top right corner), select 'HeLa 1x100min libraryDIA'. Click the 'Load' button.\n3. Repeat Step 2., to load the 'HeLa 1x100min DDA' file. \nYou have now loaded two different sets of maps.\n4. Click the big green button 'Align and analyse selected datasets'. This may take a moment - the program will update on progress and tell you when it's finished (bottom right corner).\n5. Scroll down, and select the 'Overview', 'PCA maps', 'Depth and coverage',... tabs to view the different analyses.<br>To configure your own analysis of profiling data, go to the home page and follow the instructions.",
	"upload_instructions": "1. Choose file for upload.<br>NOTE: No progress update during upload. Be patient - it can take up to 30 seconds to load.<br>WARNING!!! Max file size is 80 MB. If you upload a larger file, the tool will stall, but will not report an error message. Refresh page and upload a smaller file.<br>TIP: You can trim a large proteinGroups file by deleting all unnecessary columns (see 'Details on configuring your data').\n2. Enter experiment name.\n3. Select organism - we currently support human, mouse and Arabidopsis.\n4. Select acquisition type - we support LFQ with MaxQuant & Spectronaut (5- or 6-point profiles), SILAC with MaxQuant, or choose custom to upload any pre-processed 0-1 normalised profiles.\n5. Select name pattern used for file names - an example is given for each pre-loaded option.<br>ADVANCED: provide a custom name pattern to match your file name structure.\n6. Optional: select method to reannotate gene names (gene names supplied by MaxQuant may not be up-to-date).<br>TIP: the easiest method is 'from uniport.org'.\n7. Optional: stringency filtering can be adjusted, if necessary.<br>NOTE: default settings have been optimised for depth and profile quality.\n8. Press 'Analyse dataset'.\n9. Explore the data using the tabs below.", 
	"upload_details": "- MaxQuant proteinGroups: required columns are identifiers (gene names, protein IDs), LFQ intensities & MS/MS counts, or SILAC ratios & ratio counts/variability. Experiment names will be used to parse the experimental design (see below).\n- Spectronaut long format output (either csv or xls): required columns are PG.Genes, PG.ProteinGroups, PG.RunEvidenceCount, PG.Quantity and R.Condition. R.Condition will be used to parse the experimental design.\n- Custom upload: in case you already have processed data you can do a custom upload. Data must be 0-1 normalized. You need to define which column contains protein IDs / gene names and the range of wide format columns that contain the data. Column headers will be used to parse the experimental design.\n- Experimental design: you must provide a name pattern as a regular expression (several predefined patterns are provided), with capture groups for replicate, fraction and, optionally, condition. The latter is only used to distinguish same replicate maps of different conditions, but no differential analysis is performed. To compare quality between conditions, you should first create a separate file for each condition. Generally, fraction labels are flexible, but if you have an LFQ6 dataset and want to analyse it as LFQ5 (i.e., omitting the nuclear fraction), the nuclear fraction must be labelled '01K'.",
	"upload_error_messages": "ERROR<br>AttributeError: 'float' object has no attribute 'split'.<br><br>CAUSE<br>This error occurs when a proteinGroups file has been opened in Excel, modified (e.g., to remove columns) and saved again. This can introduce extra rows in the data frame that contain spilled-over ids.<br><br>FIX<br>Open proteinGroups file in Excel, sort data by 'protein IDs' column, from A to Z, and delete the rows at the top that only contain lists of ids and no other data. Save file under a new name. Refresh tool and upload new file.", 
    "coll_status_default": "1. Add datasets for benchmarking using one of the following methods:\nA. Analyse a dataset in the 'Analysis tab' and it will automatically appear in the 'Benchmark' tab.\nB. Upload a stored collection from a .json file. There is an option to download analysed datasets as collection.\nC. Load our stored reference datasets from the dropdown menu.<br>\n2. Tick to select the datasets that you want to compare.\n3. Press the green button 'Align and analyse selected datasets'.\n4. Explore the data using the tabs below.<br><br>Additional notes:<br><ul><li>The datasets selected here only affect the alignment of protein groups and the shared PCA space. The overlap used for benchmarking figures can be adjusted after alignment.</li><li>Press the red button 'Reset analysis to make new selection' to unlock the interface for a new selection of datasets.</li></ul>",
	"benchmark_error_messages": "ERROR<br>ValueError: level should contain all level names or all level numbers, not a mixture of the two.<br><br>CAUSE<br>Occurs when there is a mismatch in file name pattern between the datasets you are trying to align.<br><br>FIX<br>Edit file names used in the input files to ensure an identical naming format. See 'Analysis tab' for more details on name patterns. Refresh tool and load edited datasets through the 'Analysis' tab.", 
    "home_single_shortinstructions": "Upload, filter, normalize and quality control your own datasets here. This is required to then run a benchmark against other datasets.",
    "home_benchmark_shortinstructions": "Compare the performance and quality of different experimental datasets, including published reference datasets."


}